
// id,name,term,year,credits,category,middle,minor
const courseCsv = `id,name,term,year,credits,category,middle
1,建学の精神と人生,前期,1,2,基礎総合科目,総合教養,
2,宗教学,後期,1,2,基礎総合科目,総合教養
3,心理学,前期,1,2,基礎総合科目,総合教養
4,文学,前期,1,2,基礎総合科目,総合教養
5,情報倫理,後期,1,2,基礎総合科目,総合教養
6,法学,前期,1,2,基礎総合科目,総合教養
7,日本国憲法,後期,1,2,基礎総合科目,総合教養
8,社会学,後期,1,2,基礎総合科目,総合教養
9,政治学,後期,1,2,基礎総合科目,総合教養
10,経済学,前期,1,2,基礎総合科目,総合教養
11,日本事情,前期,1,2,基礎総合科目,総合教養
12,基礎数学,前期,1,2,基礎総合科目,総合教養
13,ウェルネス,前期,1,1,基礎総合科目,総合教養
14,スポーツ理論,前期,2,2,基礎総合科目,総合教養
15,ウェルネス理論,後期,2,2,基礎総合科目,総合教養
16,総合英語,前期,1,2,基礎総合科目,総合語学
17,英検中級・TOEIC基礎,後期,1,2,基礎総合科目,総合語学
18,英会話Basic I,前期,1,2,基礎総合科目,総合語学
19,英会話Basic II,後期,1,2,基礎総合科目,総合語学
20,英会話Advanced I,前期,2,2,基礎総合科目,総合語学
21,英会話Advanced II,後期,2,2,基礎総合科目,総合語学
22,初級中国語,前期,2,2,基礎総合科目,総合語学
23,中級中国語,後期,2,2,基礎総合科目,総合語学
24,初級韓国語,前期,2,2,基礎総合科目,総合語学
25,中級韓国語,後期,2,2,基礎総合科目,総合語学
26,日本語 I,前期,1,2,基礎総合科目,総合語学
27,日本語 II,後期,1,2,基礎総合科目,総合語学
28,日本語 III,前期,2,2,基礎総合科目,総合語学
29,日本語 IV,後期,2,2,基礎総合科目,総合語学
30,情報リテラシー演習 I,前期,1,2,基礎総合科目,実践力養成・キャリア開発
31,情報リテラシー演習 II,後期,1,2,基礎総合科目,実践力養成・キャリア開発
32,スタディスキル,前期,1,2,基礎総合科目,実践力養成・キャリア開発
33,ラーニングリテラシー,前期,1,1,基礎総合科目,実践力養成・キャリア開発
34,キャリアデザイン I,前期,1,2,基礎総合科目,実践力養成・キャリア開発
35,キャリアデザイン II,後期,1,2,基礎総合科目,実践力養成・キャリア開発
36,インターンシップ実習,通年期,1-4,2,基礎総合科目,実践力養成・キャリア開発
37,キャリアデザイン III,前期,2,2,基礎総合科目,実践力養成・キャリア開発
38,キャリアデザイン IV,後期,2,2,基礎総合科目,実践力養成・キャリア開発
39,キャリアデザイン V,前期,3,2,基礎総合科目,実践力養成・キャリア開発
40,キャリアデザイン VI,後期,3,2,基礎総合科目,実践力養成・キャリア開発
41,情報学入門,前期,1,2,専門教育科目,専門基礎
42,情報数学 I,後期,1,2,専門教育科目,専門基礎
43,情報ネットワーク入門,後期,1,2,専門教育科目,専門基礎
44,コンピュータ実務演習 I,前期,1,2,専門教育科目,専門基礎
45,コンピュータ実務演習 II,後期,1,2,専門教育科目,専門基礎
46,統計学入門,前期,2,2,専門教育科目,専門基礎
47,情報セキュリティ,前期,3,2,専門教育科目,専門基礎
48,情報システムの開発と管理,前期,3,2,専門教育科目,専門基礎
49,マルチメディア論,前期,3,2,専門教育科目,専門基礎
50,経営学総論 I,前期,1,2,専門教育科目,専門基礎
51,簿記 I,前期,1,2,専門教育科目,専門基礎
52,簿記 II,後期,1,2,専門教育科目,専門基礎
53,マネージメント科学,前期,2,2,専門教育科目,専門基礎
54,ビジネス実務,前期,2,2,専門教育科目,専門基礎
55,民事法,前期,2,2,専門教育科目,専門基礎
56,経営情報学 I,前期,2,2,専門教育科目,専門基礎
57,経営情報学 II,後期,3,2,専門教育科目,専門基礎
58,計算機システム論,後期,1,2,専門教育科目,専門発展
59,プログラミング初歩 I,前期,1,2,専門教育科目,専門発展
60,プログラミング初歩 II,後期,1,2,専門教育科目,専門発展
61,プログラミング実践 I,前期,2,4,専門教育科目,専門発展
62,プログラミング実践 II,後期,2,4,専門教育科目,専門発展
63,ゲームプログラミング,前期,2,2,専門教育科目,専門発展
64,eスポーツ概論,後期,2,2,専門教育科目,専門発展
65,情報処理技術演習 I,前期,2,2,専門教育科目,専門発展
66,情報処理技術演習 II,後期,2,2,専門教育科目,専門発展
67,アルゴリズムとデータ構造,前期,2,2,専門教育科目,専門発展
68,情報数学 II,前期,2,2,専門教育科目,専門発展
69,データベース論,前期,2,2,専門教育科目,専門発展
70,オペレーティングシステム論,後期,2,2,専門教育科目,専門発展
71,計測・制御論,後期,3,2,専門教育科目,専門発展
72,モバイルネットワーク,前期,3,2,専門教育科目,専門発展
73,情報処理技術演習 III,前期,3,2,専門教育科目,専門発展
74,情報処理技術演習 IV,後期,3,2,専門教育科目,専門発展
75,会計学,前期,1,2,専門教育科目,専門発展
76,コマース論,前期,2,2,専門教育科目,専門発展
77,経営組織論,後期,2,2,専門教育科目,専門発展
78,コンピュータ会計,後期,2,2,専門教育科目,専門発展
79,知的財産権,前期,3,2,専門教育科目,専門発展
80,Webデザイン,後期,1,2,専門教育科目,専門応用
81,スイッチング技術,前期,2,2,専門教育科目,専門応用
82,ルーティング技術,後期,2,2,専門教育科目,専門応用
83,SNS活用と問題解決,後期,2,2,専門教育科目,専門応用
84,デジタルビジネス論,後期,2,2,専門教育科目,専門応用
85,Webシステム,前期,2,2,専門教育科目,専門応用
86,Webプログラミング I,後期,2,2,専門教育科目,専門応用
87,Webプログラミング II,前期,3,2,専門教育科目,専門応用
88,Webプログラミング III,後期,3,2,専門教育科目,専門応用
89,ネットワークアプリケーション構築,通年期,3,4,専門教育科目,専門応用
90,インターネット技術,前期,3,2,専門教育科目,専門応用
91,マーケティング論,前期,1,2,専門教育科目,専門応用
92,消費者行動論,後期,1,2,専門教育科目,専門応用
93,経営分析,前期,2,2,専門教育科目,専門応用
94,統計学,後期,2,2,専門教育科目,専門応用
95,ビジネスプログラミング,前期,2,2,専門教育科目,専門応用
96,多変量解析,前期,3,2,専門教育科目,専門応用
97,データ解析,後期,3,2,専門教育科目,専門応用
98,データモデリング,後期,3,2,専門教育科目,専門応用
99,統計プログラミング,後期,3,2,専門教育科目,専門応用
100,機械学習,前期,3,2,専門教育科目,専門応用
101,人工知能,後期,3,2,専門教育科目,専門応用
102,英検上級 I・TOEIC応用 I,前期,2,2,専門教育科目,専門応用
103,英検上級 II・TOEIC応用 II,後期,2,2,専門教育科目,専門応用
104,ビジネス英語,後期,3,2,専門教育科目,専門応用
105,プレゼミ I,前期,1,2,専門教育科目,演習
106,プレゼミ II,後期,1,2,専門教育科目,演習
107,基礎ゼミ,通年,2,4,専門教育科目,演習
108,情報学基礎演習,通年,2,4,専門教育科目,演習
109,専門ゼミ I,通年,3,4,専門教育科目,演習
110,情報学専門演習 I,通年,3,4,専門教育科目,演習
111,専門ゼミ II,通年,4,4,専門教育科目,演習
112,情報学専門演習 II,通年,4,4,専門教育科目,演習
113,スポーツ,後期,1,1,基礎総合科目,総合教養
`;
// id,name,term,year,credits,category,middle

// SAMPLE ONLY: replace with the actual institutional mapping.
const certCsv = `cert_id,cert_name,course_id
FE,基本情報技術者,60
FE,基本情報技術者,61
FE,基本情報技術者,62
FE,基本情報技術者,67
FE,基本情報技術者,70
FE,基本情報技術者,73
FE,基本情報技術者,74
AP,応用情報技術者,48
AP,応用情報技術者,58
AP,応用情報技術者,61
AP,応用情報技術者,62
AP,応用情報技術者,67
AP,応用情報技術者,70
MDASH_L,リテラシーレベル,5
MDASH_L,リテラシーレベル,12
MDASH_L,リテラシーレベル,31
MDASH_L,リテラシーレベル,41
MDASH_L,リテラシーレベル,46
MDASH_L,リテラシーレベル,56
MDASH_L,リテラシーレベル,57
MDASH_L,リテラシーレベル,91
MDASH_L,リテラシーレベル,92
MDASH_L,リテラシーレベル,93
MDASH_L,リテラシーレベル,95
MDASH_A,応用基礎レベル,42
MDASH_A,応用基礎レベル,43
MDASH_A,応用基礎レベル,47
MDASH_A,応用基礎レベル,53
MDASH_A,応用基礎レベル,61
MDASH_A,応用基礎レベル,62
MDASH_A,応用基礎レベル,67
MDASH_A,応用基礎レベル,68
MDASH_A,応用基礎レベル,69
MDASH_A,応用基礎レベル,94
MDASH_A,応用基礎レベル,96
MDASH_A,応用基礎レベル,97
MDASH_A,応用基礎レベル,98
MDASH_A,応用基礎レベル,99
MDASH_A,応用基礎レベル,100
MDASH_A,応用基礎レベル,101
`;

`

情報リテラシー演習 II
マーケティング論
情報学入門
消費者行動論
基礎数学
マーケティング・リサーチ
情報倫理
経営分析
統計学入門
ビジネスプログラミング
経営情報学 I
経営情報学 II
`

// console.log(
//   SELECT(courseDb, "id", "name")
//     .filter(e=>`
// オペレーティングシステム論
// プログラミング実践 I
// プログラミング実践 II
// 計算機システム論
// アルゴリズムとデータ構造
// 情報システムの開発と管理
// `.trim().split("\n").includes(e[1]))
//     .map(e=>e[0])
//     .map(e=>"AP,応用情報技術者,"+e)
//     .join("\n")
// );

const creditsListCsv = `credit_name,credit_id,credit_limit
総修得,total_completed,124
基礎総合,basic_completed,40
総合教養,generalEducation_completed,12
総合語学,language_completed,6
実践力養成・キャリア開発,careerAndSkills_completed,12
専門教育科目,specialized_completed,84
専門基礎,specialized_basic_completed,20
専門発展,specialized_advanced_completed,14
専門応用,specialized_applied_completed,24
履修中,in_progress_count,0
`;
/*総修得,total-completed,124
基礎総合,basic-completed,40
総合教養,generalEducation-completed,12
総合語学,language-completed,6
実践力養成・キャリア開発,careerAndSkills-completed,12
専門教育科目,specialized-completed,84
専門基礎,specialized_basic-completed,20
専門発展,specialized_advanced-completed,14
専門応用,specialized_applied-completed,24
履修中,in-progress-count,0
*/

// const courseDb = csvToMap(courseCsv, 'id', { credits: Number });
const courseDb = csvToMap(courseCsv, 'id', { year: Number, credits: Number });

const certificationDb = csvToGroupedMap(certCsv, 'cert_id', { course_id: String });

const creditsSummaryDb = csvToMap(creditsListCsv, 'credit_id', { credit_limit: Number });